# распечатать введеное число по-русски

def say_number(number):
    units = ["ноль",
             "один",
             "два",
             "три",
             "четыре",
             "пять",
             "шесть",
             "семь",
             "восемь",
             "девять"]
    
    tens = ["",
            "десять",
            "двадцать",
            "тридцать",
            "сорок",
            "пятьдесят",
            "шестьдесят",
            "семьдесят",
            "восемьдесят",
            "девяносто"]
    
    if number >=0 and number <= 9:
        return units[number]
    
    
number = int(input("Введите число:"))
text = say_number(number)
print("Текст:", text)